package main

func main(){

	/*
	   1.배열
	       배열은 연속적인 메모리 공간에 동일한 타입의 데이터를 순차적으로 저장하는
	       자료 구조이다.
	       Go의 배열은 첫번째 요소가 0번부터 증가하는 Zero based array 이다.
	       선언은 다음의 형식을 따른다.

	       			var 변수명 [배열크기]데이터타입

		배열 크기를 데이터타입 앞에 써주는 것이 다른 언어들과는 다르다.
		Go에서 배열의 크기는 Type을 구성하는 한 요소이다.
		즉 [3]int와 [5]int 는 서로 다른 타입으로 인식된다.
	*/

	var a [3]int
	a[0] = 1
	a[1] = 2
	a[2] = 3
	println(a[1])

	/*
	   2.배열의 초기화
	      배열을 정의할 때, 초기값을 설정할 수도 있다.
	      초기값은 "[배열크기]데이터타입" 뒤에 { } 괄호를 두고
	      초기값을 순서대로 적으면 된다.
	*/

	var b = [3]int {1, 2, 3}
	println(b[2])

	/*
	   3.다차원 배열, 그리고 그의 초기화
	      Go언어는 다차원 배열을 지원한다. 다차원 배열은 배열크기 부분을
	      복수 개로 설정하여 선언한다. 예를 들어, 3 * 4 * 5 차원 정수 배열을 
	      다음과 같이 선언한다.
	*/

	var c [3][4][5]int
	c[2][3][3] = 1
	println(c[2][3][3])

	// 그리고 그의 초기화

	var d = [2][3]int{
		{1, 2, 3},
		{4, 5, 6}, // 끝에 콤마 추가
	}

	println(d[1][2])


}
